Digger run report at 2023-11-10 00:32:10 (UTC)
Plan for devabolmasov/digger#devabolmasov
```terraform
Terraform will perform the following actions:

  # aws_vpc.my-vpc must be replaced
-/+ resource "aws_vpc" "my-vpc" {
      ~ arn                                  = "arn:aws:ec2:eu-north-1:534279642551:vpc/vpc-0683bbf867ae6b5a5" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "10.0.1.0/24" -> "10.0.2.0/24" # forces replacement
      ~ default_network_acl_id               = "acl-00bf451f208dd8a7e" -> (known after apply)
      ~ default_route_table_id               = "rtb-0dfe71f13c96588d2" -> (known after apply)
      ~ default_security_group_id            = "sg-0a64750e8610796de" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-08005cf80b87e0b8a" -> (known after apply)
      ~ enable_dns_hostnames                 = false -> (known after apply)
      ~ enable_network_address_usage_metrics = false -> (known after apply)
      ~ id                                   = "vpc-0683bbf867ae6b5a5" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-0dfe71f13c96588d2" -> (known after apply)
      ~ owner_id                             = "534279642551" -> (known after apply)
      ~ tags                                 = {
          ~ "Name" = "edited_from_vcs_2-vpc" -> "edited_from_vcs_4-vpc"
        }
      ~ tags_all                             = {
          ~ "Name" = "edited_from_vcs_2-vpc" -> "edited_from_vcs_4-vpc"
        }
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Terraform plan validation check (devabolmasov)
Terraform plan validation checks succeeded :white_check_mark:
